//====算术运算符
+	加
-	减
*	乘
/	除
%	取余
++	x=i++;等价于x=i;i=i+1;
	x=++i;等价于i=i+1;x=i;
--	与上++相对应

//====关系运算符
==	相等
!=	不等
>	大于
>=	大于等于
<	小于
<=	小于等于

//====逻辑运算符
&&	与
||	或
！	非

//====位运算符
&	按位与		a&b
|	按位或		a|b
^	按位异或	a|b
~	按位取反	~a
<<	左移		a<<n
>>	右移		a>>n

//====赋值运算符
=	指定		a[]n
+=	加上		a=a+n;
-=	减去		a=a-n;
*=	乘上		a=a*n;
/=	除以		a=a/n;
%=	取余		a=a%n;
&=	按位与		a=a&n;
|=	按位或		a=a|n;
^=	按位异或	a=a^n;
<<=	左移		a=a<<n;
>>=	右移		a=a>>n;

//====条件运算符
max =(logical)? a:b;
等同于
if(logical)
	max=a;
else
	max=b;

//====指针和地址运算符
*	取地址
&	取内容